tutorials/multicomponentFluid/shearlayer_DLB/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | DLBFoam: Dynamic Load Balancing                 |
|  \\    /   O peration     | for fast reactive simulations                   |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  | 2020, Aalto University, Finland                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//convertToMeters 3.14159265;
convertToMeters 0.008;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 0.01)
    (1 0 0.01)
    (1 1 0.01)
    (0 1 0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 200 1) simpleGrading (1 1 1)
);

        edges
        (
        );

        boundary
        (

         upperBoundary
         {
         type cyclic;
         neighbourPatch lowerBoundary;
         faces
         (
          (3 7 6 2)
         );
         }
         lowerBoundary
         {
         type cyclic;
         neighbourPatch upperBoundary;
         faces
         (
          (1 5 4 0)
         );
         }
         leftBoundary
{
        type cyclic;
        neighbourPatch rightBoundary;
        faces
                (
                 (0 4 7 3)
                );
}

rightBoundary
{
        type cyclic;
        neighbourPatch leftBoundary;
        faces
                (
                 (2 6 5 1)
                );
}
frontAndBack
{
        type empty;
        faces
                (
                 (0 3 2 1)
                 (4 5 6 7)
                );
}
);

mergePatchPairs
(
);

// ************************************************************************* //
